[View in Colaboratory](https://colab.research.google.com/github/harjeevansingh/ML_ON1Acadview/blob/master/assignment_11.ipynb)

In [0]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import re
%matplotlib inline



from sklearn import linear_model
from sklearn.metrics import accuracy_score 
from sklearn.model_selection import train_test_split

In [0]:
df_train=pd.read_csv('https://raw.githubusercontent.com/harjeevansingh/datasets/titanic-train-test/titanic_train.csv')
df_test = pd.read_csv('https://raw.githubusercontent.com/harjeevansingh/datasets/titanic-train-test/titanic_test.csv')

In [42]:
df_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [43]:
df_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [0]:
frames = [df_train, df_test]

train1 = pd.concat(frames)

In [45]:
train1.head(10)

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket
0,22.0,NaN,S,7.2500,"Braund, Mr. Owen Harris",0,1,3,male,1,0.0,A/5 21171
1,38.0,C85,C,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,2,1,female,1,1.0,PC 17599
2,26.0,NaN,S,7.9250,"Heikkinen, Miss. Laina",0,3,3,female,0,1.0,STON/O2. 3101282
3,35.0,C123,S,53.1000,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,4,1,female,1,1.0,113803
4,35.0,NaN,S,8.0500,"Allen, Mr. William Henry",0,5,3,male,0,0.0,373450
5,NaN,NaN,Q,8.4583,"Moran, Mr. James",0,6,3,male,0,0.0,330877
6,54.0,E46,S,51.8625,"McCarthy, Mr. Timothy J",0,7,1,male,0,0.0,17463
7,2.0,NaN,S,21.0750,"Palsson, Master. Gosta Leonard",1,8,3,male,3,0.0,349909
8,27.0,NaN,S,11.1333,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",2,9,3,female,0,1.0,347742
9,14.0,NaN,C,30.0708,"Nasser, Mrs. Nicholas (Adele Achem)",0,10,2,female,1,1.0,237736

In [0]:
train1['Survived']=train1['Survived'].dropna()

In [47]:
train1.isnull().sum()

Age             263
Cabin          1014
Embarked          2
Fare              1
Name              0
Parch             0
PassengerId       0
Pclass            0
Sex               0
SibSp             0
Survived          0
Ticket            0
dtype: int64

In [0]:
train1['Age'] = train1.Age.fillna(train1.Age.median())

In [0]:
train1['Fare'] = train1.Fare.fillna(train1.Fare.median())

In [0]:
train1['Embarked'] = train1.Embarked.fillna('S')

In [0]:
Has_Cabin=~train1['Cabin'].isnull()

In [0]:
train1.loc[:,'Has_Cabin'] = Has_Cabin

In [53]:
train1.head()

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket,Has_Cabin
0,22.0,NaN,S,7.2500,"Braund, Mr. Owen Harris",0,1,3,male,1,0.0,A/5 21171,False
1,38.0,C85,C,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,2,1,female,1,1.0,PC 17599,True
2,26.0,NaN,S,7.9250,"Heikkinen, Miss. Laina",0,3,3,female,0,1.0,STON/O2. 3101282,False
3,35.0,C123,S,53.1000,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,4,1,female,1,1.0,113803,True
4,35.0,NaN,S,8.0500,"Allen, Mr. William Henry",0,5,3,male,0,0.0,373450,False

In [0]:
# salutation= re.compile(r'(Mrs|Mr|Miss|Master|[.]))
# title=salutation.search(train1['Name'][])

In [0]:
# train1['Categorical_Age']=pd.qcut(train1['Age'],4)

In [56]:
train1.head()

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket,Has_Cabin
0,22.0,NaN,S,7.2500,"Braund, Mr. Owen Harris",0,1,3,male,1,0.0,A/5 21171,False
1,38.0,C85,C,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,2,1,female,1,1.0,PC 17599,True
2,26.0,NaN,S,7.9250,"Heikkinen, Miss. Laina",0,3,3,female,0,1.0,STON/O2. 3101282,False
3,35.0,C123,S,53.1000,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,4,1,female,1,1.0,113803,True
4,35.0,NaN,S,8.0500,"Allen, Mr. William Henry",0,5,3,male,0,0.0,373450,False

In [0]:
# train1['Categorical_Fare']=pd.qcut(train1['Fare'],4)

In [58]:
train1['Categorical_Age']=pd.qcut(train1['Age'],q=4,labels=False)
train1['Categorical_Fare']=pd.qcut(train1['Fare'],q=4,labels=False)
train1.head()

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket,Has_Cabin,Categorical_Age,Categorical_Fare
0,22.0,NaN,S,7.2500,"Braund, Mr. Owen Harris",0,1,3,male,1,0.0,A/5 21171,False,0,0
1,38.0,C85,C,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,2,1,female,1,1.0,PC 17599,True,3,3
2,26.0,NaN,S,7.9250,"Heikkinen, Miss. Laina",0,3,3,female,0,1.0,STON/O2. 3101282,False,1,1
3,35.0,C123,S,53.1000,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,4,1,female,1,1.0,113803,True,2,3
4,35.0,NaN,S,8.0500,"Allen, Mr. William Henry",0,5,3,male,0,0.0,373450,False,2,1

In [0]:
del train1['Name']
del train1['Cabin']
del train1['Age']
del train1['PassengerId']
del train1['SibSp']
del train1['Ticket']
del train1['Parch']
del train1['Fare']

In [60]:
train1.head()

,Embarked,Pclass,Sex,Survived,Has_Cabin,Categorical_Age,Categorical_Fare
0,S,3,male,0.0,False,0,0
1,C,1,female,1.0,True,3,3
2,S,3,female,1.0,False,1,1
3,S,1,female,1.0,True,2,3
4,S,3,male,0.0,False,2,1

In [0]:
train1 = pd.get_dummies(train1, columns=['Embarked'])

In [0]:
train1 = pd.get_dummies(train1, columns=['Sex'])

In [0]:
train1 = pd.get_dummies(train1, columns=['Has_Cabin'])

In [0]:
# train1 = pd.get_dummies(train1, columns=['Categorical_Age'])

In [0]:
labels=train1['Survived'].values

In [0]:
del train1['Survived']

In [67]:
train1.head()

,Pclass,Categorical_Age,Categorical_Fare,Embarked_C,Embarked_Q,Embarked_S,Sex_female,Sex_male,Has_Cabin_False,Has_Cabin_True
0,3,0,0,0,0,1,0,1,1,0
1,1,3,3,1,0,0,1,0,0,1
2,3,1,1,0,0,1,1,0,1,0
3,1,2,3,0,0,1,1,0,0,1
4,3,2,1,0,0,1,0,1,1,0

In [0]:
# from sklearn.model_selection import train_test_split

In [0]:
(x_train,x_test,y_train,y_test)=train_test_split(train1,labels,test_size=0.3,random_state=42)

In [0]:
# from sklearn.linear_model import LogisticRegression

In [0]:
model = linear_model.LogisticRegression()

In [72]:
x_train.shape

(916, 10)

In [73]:
y_train.shape

(916,)

In [74]:
model.fit(x_train, y_train)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
          intercept_scaling=1, max_iter=100, multi_class='ovr', n_jobs=1,
          penalty='l2', random_state=None, solver='liblinear', tol=0.0001,
          verbose=0, warm_start=False)

In [75]:
model.score(x_test,y_test)

0.7150127226463104